; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v8 ?v9)
             (pred_10 ?v4 ?v10)
             (pred_9 ?v8 ?v10)
             (pred_7 ?v7 ?v8 )
	     (pred_11 ?v8)
             (pred_8 ?v13)
             (pred_4 ?v4)
             (pred_2 ?v10)
             (pred_5 ?v8)
             (pred_1 ?v4)
             (pred_12 ?v8)
             (pred_6 ))



(:action op_4
:parameters (?v3 ?v12 ?v5 ?v2)
:precondition (and (pred_8 ?v3) (pred_8 ?v12) (pred_4 ?v5) (pred_2 ?v2)
          (pred_3 ?v3 ?v12) (pred_10 ?v5 ?v2)
                   (pred_9 ?v12 ?v2) (pred_11 ?v3) 
                   (pred_5 ?v12) (pred_1 ?v5))
:effect (and  (pred_12 ?v12) (not (pred_5 ?v12))))


(:action op_5
:parameters (?v3 ?v11)
:precondition (and (pred_8 ?v3) (pred_8 ?v11)
               (pred_11 ?v3) (pred_3 ?v3 ?v11) (pred_12 ?v11))
:effect (and (pred_11 ?v11) (not (pred_11 ?v3))))

(:action op_1
:parameters (?v3 ?v5)
:precondition (and (pred_8 ?v3) (pred_4 ?v5) 
                  (pred_11 ?v3) (pred_7 ?v5 ?v3) (pred_6 ))
:effect (and (pred_1 ?v5)
   (not (pred_7 ?v5 ?v3)) (not (pred_6 ))))


(:action op_2
:parameters (?v3 ?v1 ?v6)
:precondition (and (pred_8 ?v3) (pred_4 ?v1) (pred_4 ?v6)
                  (pred_11 ?v3) (pred_1 ?v6) (pred_7 ?v1 ?v3))
:effect (and (pred_1 ?v1) (pred_7 ?v6 ?v3)
        (not (pred_1 ?v6)) (not (pred_7 ?v1 ?v3))))

(:action op_3
:parameters (?v3 ?v5)
:precondition (and (pred_8 ?v3) (pred_4 ?v5) 
                  (pred_11 ?v3) (pred_1 ?v5))
:effect (and (pred_6 ) (pred_7 ?v5 ?v3) (not (pred_1 ?v5)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_04 obj_10 obj_03 obj_17 obj_12 obj_09 obj_13 obj_18 obj_19 obj_11 obj_08 obj_20 obj_21 obj_02 obj_15 obj_22
    obj_16 obj_01 obj_05
    obj_06 obj_14 obj_07
    )

    (:init
       (pred_6)

       (pred_8 obj_04)
       (pred_8 obj_10)
       (pred_8 obj_03)
       (pred_8 obj_17)
       (pred_8 obj_12)
       (pred_8 obj_09)
       (pred_8 obj_13)
       (pred_8 obj_18)
       (pred_8 obj_19)
       (pred_8 obj_11)
       (pred_8 obj_08)
       (pred_8 obj_20)
       (pred_8 obj_21)
       (pred_8 obj_02)
       (pred_8 obj_15)
       (pred_8 obj_22)
       (pred_2 obj_16)
       (pred_2 obj_01)
       (pred_2 obj_05)
       (pred_4 obj_06)
       (pred_4 obj_14)
       (pred_4 obj_07)

       (pred_3 obj_04 obj_12)
       (pred_3 obj_04 obj_10)
       (pred_3 obj_10 obj_09)
       (pred_3 obj_10 obj_03)
       (pred_3 obj_10 obj_04)
       (pred_3 obj_03 obj_13)
       (pred_3 obj_03 obj_17)
       (pred_3 obj_03 obj_10)
       (pred_3 obj_17 obj_18)
       (pred_3 obj_17 obj_03)
       (pred_3 obj_12 obj_19)
       (pred_3 obj_12 obj_09)
       (pred_3 obj_12 obj_04)
       (pred_3 obj_09 obj_11)
       (pred_3 obj_09 obj_13)
       (pred_3 obj_09 obj_10)
       (pred_3 obj_09 obj_12)
       (pred_3 obj_13 obj_08)
       (pred_3 obj_13 obj_18)
       (pred_3 obj_13 obj_03)
       (pred_3 obj_13 obj_09)
       (pred_3 obj_18 obj_20)
       (pred_3 obj_18 obj_17)
       (pred_3 obj_18 obj_13)
       (pred_3 obj_19 obj_21)
       (pred_3 obj_19 obj_11)
       (pred_3 obj_19 obj_12)
       (pred_3 obj_11 obj_02)
       (pred_3 obj_11 obj_08)
       (pred_3 obj_11 obj_09)
       (pred_3 obj_11 obj_19)
       (pred_3 obj_08 obj_15)
       (pred_3 obj_08 obj_20)
       (pred_3 obj_08 obj_13)
       (pred_3 obj_08 obj_11)
       (pred_3 obj_20 obj_22)
       (pred_3 obj_20 obj_18)
       (pred_3 obj_20 obj_08)
       (pred_3 obj_21 obj_02)
       (pred_3 obj_21 obj_19)
       (pred_3 obj_02 obj_15)
       (pred_3 obj_02 obj_11)
       (pred_3 obj_02 obj_21)
       (pred_3 obj_15 obj_22)
       (pred_3 obj_15 obj_08)
       (pred_3 obj_15 obj_02)
       (pred_3 obj_22 obj_20)
       (pred_3 obj_22 obj_15)
       (pred_5 obj_10)
       (pred_5 obj_15)
       (pred_5 obj_04)
       (pred_9  obj_10 obj_16)
       (pred_9  obj_15 obj_01)
       (pred_9  obj_04 obj_05)
       (pred_12 obj_03)
       (pred_12 obj_17)
       (pred_12 obj_12)
       (pred_12 obj_09)
       (pred_12 obj_13)
       (pred_12 obj_18)
       (pred_12 obj_19)
       (pred_12 obj_11)
       (pred_12 obj_08)
       (pred_12 obj_20)
       (pred_12 obj_21)
       (pred_12 obj_02)
       (pred_12 obj_22)

       (pred_10  obj_06 obj_16)
       (pred_10  obj_14 obj_01)
       (pred_10  obj_07 obj_05)
       (pred_7 obj_06 obj_22)
       (pred_7 obj_14 obj_09)
       (pred_7 obj_07 obj_21)
       (pred_11 obj_11)
    )

    (:goal (and
       (pred_7 obj_07 obj_22)
    ))
(:constraints
  (always (not (pred_11 obj_19)))
)
)

; plan
1. (op_5 obj_11 obj_02)
   deleted: (pred_11 obj_11)
   added: (pred_11 obj_02)
   goals met: 0 of 1
2. (op_5 obj_02 obj_21)
   deleted: (pred_11 obj_02)
   added: (pred_11 obj_21)
   goals met: 0 of 1
3. (op_1 obj_21 obj_07)
   deleted: (pred_7 obj_07 obj_21) (pred_6)
   added: (pred_1 obj_07)
   goals met: 0 of 1
4. (op_5 obj_21 obj_02)
   deleted: (pred_11 obj_21)
   added: (pred_11 obj_02)
   goals met: 0 of 1
5. (op_5 obj_02 obj_11)
   deleted: (pred_11 obj_02)
   added: (pred_11 obj_11)
   goals met: 0 of 1
6. (op_5 obj_11 obj_08)
   deleted: (pred_11 obj_11)
   added: (pred_11 obj_08)
   goals met: 0 of 1
7. (op_5 obj_08 obj_20)
   deleted: (pred_11 obj_08)
   added: (pred_11 obj_20)
   goals met: 0 of 1
8. (op_5 obj_20 obj_22)
   deleted: (pred_11 obj_20)
   added: (pred_11 obj_22)
   goals met: 0 of 1
9. (op_2 obj_22 obj_06 obj_07)
   deleted: (pred_1 obj_07) (pred_7 obj_06 obj_22)
   added: (pred_1 obj_06) (pred_7 obj_07 obj_22)
   goals met: 1 of 1
